cask_args appdir: '/Applications'

tap 'PX4/homebrew-px4'
tap 'caskroom/cask'
tap 'osx-cross/avr'
tap 'railwaycat/emacsmacport'
tap 'thoughtbot/formulae'

brew 'ack'
brew 'autojump'
brew 'avr-gcc'
brew 'aws-keychain'
brew 'awscli'
brew 'cask'
brew 'clojurescript'
brew 'curl'
brew 'dfu-programmer'
brew 'dnsmasq'
brew 'editorconfig'
brew 'gcc-arm-none-eabi'
brew 'git'
brew 'htop'
brew 'hub'
brew 'icdiff'
brew 'imagemagick'
brew 'leiningen'
brew 'mas'
brew 'nginx'
brew 'nvm'
brew 'rbenv'
brew 'rcm'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'rlwrap'
brew 'siege'
brew 'the_silver_searcher'
brew 'tmux'
brew 'webp'
brew 'yarn'
brew 'zlib'
brew 'zsh'

cask 'adobe-creative-cloud'
cask 'alfred'
cask 'android-file-transfer'
cask 'android-studio'
cask 'anybar'
cask 'archiver'
cask 'arq'
cask 'dropbox'
cask 'emacs-mac-official-icon'
cask 'firefox'
cask 'google-chrome'
cask 'hammerspoon'
cask 'hipchat'
cask 'iterm2'
cask 'java'
cask 'karabiner-elements'
cask 'numi'
cask 'opera'
cask 'rightfont'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'teamviewer'
cask 'telegram-desktop'
cask 'textual'
cask 'tunnelbear'
cask 'virtualbox'
cask 'vlc'

mas 'Boxy', id: 1053031090
mas 'Xcode', id: 497799835 
