cask_args appdir: '/Applications'

tap 'PX4/homebrew-px4'
tap 'caskroom/cask'
tap 'osx-cross/avr'
tap 'railwaycat/emacsmacport'
tap 'thoughtbot/formulae'

brew 'ack'
brew 'asciinema'
brew 'autojump'
brew 'automake'
brew 'avr-gcc'
brew 'aws-keychain'
brew 'awscli'
brew 'cask'
brew 'clojurescript'
brew 'cocoapods'
brew 'coreutils'
brew 'curl'
brew 'dfu-programmer'
brew 'dnsmasq'
brew 'editorconfig'
brew 'ffmpeg'
brew 'gcc-arm-none-eabi'
brew 'git'
brew 'github-markdown-toc'
brew 'gnu-sed'
brew 'gnupg'
brew 'gradle'
brew 'htop'
brew 'hub'
brew 'icdiff'
brew 'imagemagick'
brew 'jq'
brew 'leiningen'
brew 'makeicon'
brew 'markdown'
brew 'mas'
brew 'nasm'
brew 'nginx'
brew 'nvm'
brew 'openssl@1.1'
brew 'osx-cross/avr/avr-gcc'
brew 'pidcat'
brew 'px4/px4/gcc-arm-none-eabi'
brew 'rbenv'
brew 'rcm'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'rlwrap'
brew 'siege'
brew 'speedtest-cli'
brew 'texi2html'
brew 'texinfo'
brew 'the_silver_searcher'
brew 'thoughtbot/formulae/rcm'
brew 'tig'
brew 'tmate'
brew 'tmux'
brew 'ttyd'
brew 'unar'
brew 'watch'
brew 'watchman'
brew 'webp'
brew 'wget'
brew 'yarn'
brew 'zeromq'
brew 'zlib'
brew 'zsh'

cask 'adobe-creative-cloud'
cask 'alfred'
cask 'android-file-transfer'
cask 'android-sdk'
cask 'android-studio'
cask 'anybar'
cask 'archiver'
cask 'arq'
cask 'astro'
cask 'atom-beta'
cask 'charles'
cask 'dash'
cask 'discord'
cask 'dropbox'
cask 'emacs-mac-official-icon'
cask 'eqmac'
cask 'expo-xde'
cask 'fastlane'
cask 'firefox'
cask 'fontplop'
cask 'gitter'
cask 'google-chrome'
cask 'hammerspoon'
cask 'insomnia'
cask 'iterm2'
cask 'java'
cask 'java8'
cask 'karabiner-elements'
cask 'ngrok'
cask 'numi'
cask 'opera'
cask 'quik'
cask 'rightfont'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'teamviewer'
cask 'telegram-desktop'
cask 'textual'
cask 'tunnelbear'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'xquartz'
cask 'xscope'

mas 'Boxy', id: 1053031090
mas 'Xcode', id: 497799835
