cask_args appdir: '/Applications'

tap 'PX4/homebrew-px4'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'osx-cross/avr'
tap 'thoughtbot/formulae'

# first install java since other packages depend on this:
# gradle, clojurescript

brew '1password-cli'
brew 'ack'
brew 'asciinema'
brew 'autojump'
brew 'automake'
brew 'avr-gcc'
brew 'avrdude'
brew 'aws-keychain'
brew 'awscli'
brew 'cask'
brew 'coreutils'
brew 'curl'
brew 'dfu-programmer'
brew 'dnsmasq'
brew 'editorconfig'
brew 'ffmpeg'
brew 'fish'
brew 'fnm'
brew 'gcc-arm-none-eabi'
brew 'git'
brew 'github-markdown-toc'
brew 'gnu-sed'
brew 'gnupg'
brew 'gradle'
brew 'htop'
brew 'hub'
brew 'icdiff'
brew 'imagemagick'
brew 'ispell'
brew 'jq'
brew 'leiningen'
brew 'markdown'
brew 'mas'
brew 'nasm'
brew 'nginx'
brew 'openssl@1.1'
brew 'osx-cross/avr/avr-gcc'
brew 'pidcat'
brew 'px4/px4/gcc-arm-none-eabi'
brew 'rbenv'
brew 'rcm'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'rlwrap'
brew 'siege'
brew 'speedtest-cli'
brew 'texi2html'
brew 'texinfo'
brew 'the_silver_searcher'
brew 'thoughtbot/formulae/rcm'
brew 'tig'
brew 'tmate'
brew 'tmux'
brew 'ttyd'
brew 'unar'
brew 'watch'
brew 'watchman'
brew 'webp'
brew 'wget'
brew 'zeromq'
brew 'zlib'

cask '1password'
cask 'alfred'
cask 'android-studio'
cask 'archiver'
cask 'arc'
cask 'arq'
cask 'docker'
cask 'charles'
cask 'dash'
cask 'discord'
cask 'dropbox'
cask 'firefox'
cask 'iina'
cask 'iterm2'
cask 'mimestream'
cask 'ngrok'
cask 'notion'
cask 'numi'
cask 'rectangle'
cask 'rightfont'
cask 'sequel-pro'
cask 'skype'
cask 'spotify'
cask 'stats'
cask 'teamviewer'
cask 'telegram-desktop'
cask 'tunnelbear'
cask 'visual-studio-code-insiders'
cask 'vlc'
cask 'xquartz'
cask 'xscope'

mas 'Xcode', id: 497799835
